package by.it.lyaleko.lesson02;

import java.util.Scanner;

/* Нужно написать программу, которая вводит два числа с клавиатуры
и выводит их сумму на экран в виде

Ввод:
34 26

Вывод:
Sum = 26
*/
class TaskC1 {
//        Это не компилируется
//
//        public static void main(String[] args) {
//             throw Exception
//            Scanner in = new Scanner(System.in);
//            while (true) {
//                int a = in.nextInt();
//                int b = in.nextInt();
//                int sum = a + b;
//                if (a = 34; b = 26) {
//                    System.out.println(sum);
//                    return;
//                }
            }






